Autodesk.Revit.DB.Structure.RebarSpliceGeometry.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarSpliceGeometry.SpliceNormal
Identifies the splice face normal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: spliceNormal has zero length.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceGeometry.SpliceOrigin
Identifies the splice face origin.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceGeometry.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Constructs a RebarSpliceGeometry.
spliceOrigin:
The splice face origin.
spliceNormal:
The splice face normal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
spliceNormal has zero length.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceGeometry
This class consists of a vector and a point which will be projected to the nearest Rebar curve.
Remarks:
The splice will be done with a plane that contains this point and has the normal the provided vector.
If this plane is intersecting other Rebar curves these intersection will not be taken into account.
Since:
2025